출처 : 오라클 SQL과 PL/SQL을 다루는 기술

# 그룹 쿼리와 집합 연산자 알아 보기

In [53]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [54]:
%sql oracle://ora_user:sirin@127.0.0.1:1521/myoracle

# 기본 집계 함수

## COUNT(expr)

- 쿼리 결과 건수, 즉 전체 로우 수를 반환 (행 갯수)
- NULL값은 계산이 되지 않는다

In [55]:
%sql SELECT count(*) FROM employees

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(107,)]

In [56]:
%sql SELECT count(employee_id) FROM employees

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(107,)]

In [57]:
%%sql

-- NULL이 들어있는 컬럼

SELECT count(department_id) FROM employees

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(106,)]

- DISTICT를 붙이면 뒤따라 나오는 컬럼에 있는 유일한 값만 조회된다

In [58]:
%%sql

SELECT count(DISTINCT department_id)
FROM employees

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(11,)]

In [59]:
%%sql

SELECT DISTINCT department_id
FROM employees
ORDER BY 1

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(10,),
 (20,),
 (30,),
 (40,),
 (50,),
 (60,),
 (70,),
 (80,),
 (90,),
 (100,),
 (110,),
 (None,)]

## SUM(expr)

- 합계를 반환하는 함수

In [60]:
%%sql

SELECT
    SUM(salary)
    , SUM(DISTINCT salary)
FROM employees

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(691416, 409908)]

## AVG(expr)

- 평균값을 반환한다

In [61]:
%%sql

SELECT
    AVG(salary)
    , AVG(DISTINCT salary)
FROM employees

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(Decimal('6461.831775700934579439252336448598130841'), Decimal('7067.379310344827586206896551724137931034'))]

## MIN(expr), MAX(expr)

- 최솟값, 최댓값을 반환한다

In [62]:
%%sql

SELECT
    MIN(salary)
    , MAX(salary)
FROM employees

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(2100, 24000)]

## VARIANCE(expr), STDDEV(expr)

- 분산과 표준편차를 반환한다

In [63]:
%%sql

SELECT
    VARIANCE(salary)
    , STDDEV(salary)
FROM employees

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(Decimal('15284813.66954681713983424440134015164874'), Decimal('3909.579730552481921059198878167256201202'))]

# GROUP BY 절과 HAVING 절

- 특정 그룹으로 묶어 데이터를 집계함

In [64]:
%%sql

SELECT
    department_id,
    SUM(salary)
FROM employees
GROUP BY department_id
ORDER BY department_id

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(10, 4400),
 (20, 19000),
 (30, 24900),
 (40, 6500),
 (50, 156400),
 (60, 28800),
 (70, 10000),
 (80, 304500),
 (90, 58000),
 (100, 51608),
 (110, 20308),
 (None, 7000)]

In [65]:
%%sql

-- 2013년 지역별 가계대출 총 잔액

SELECT
    period
    , region
    , SUM(loan_jan_amt) totl_jan
FROM kor_loan_status
WHERE period LIKE '2013%' AND rownum <= 10
GROUP BY period, region
ORDER BY period, region

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('201310', '경남', Decimal('36254.3')),
 ('201310', '경북', Decimal('21706.6')),
 ('201310', '서울', Decimal('128066.1')),
 ('201310', '세종', Decimal('2583.7')),
 ('201310', '제주', Decimal('5142.7')),
 ('201311', '경남', Decimal('36746.5')),
 ('201311', '경북', Decimal('22060.9')),
 ('201311', '서울', Decimal('128418.4')),
 ('201311', '세종', Decimal('2653.4')),
 ('201311', '제주', Decimal('5209.2'))]

# ROLLUP절과 CUBE 절

## ROLLUP(expr1, expr2, ...)

- expr로 명시한 표현식을 기준으로 집계한 결과, 즉 추가적인 집계 정보를 보여준다
- 순차적으로 집계를 함

In [66]:
%%sql

SELECT
    period
    , gubun
    , SUM(loan_jan_amt) totl_nam
FROM kor_loan_status
WHERE period LIKE '2013%'
GROUP BY period, gubun
ORDER BY period

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('201310', '기타대출', 676078),
 ('201310', '주택담보대출', Decimal('411415.9')),
 ('201311', '기타대출', Decimal('681121.3')),
 ('201311', '주택담보대출', Decimal('414236.9'))]

In [67]:
%%sql

SELECT
    period
    , gubun
    , SUM(loan_jan_amt) totl_nam
FROM kor_loan_status
WHERE period LIKE '2013%'
GROUP BY ROLLUP(period, gubun)

-- 10월 합산, 11월 합산, 전체 합산도 같이 표시된다

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('201310', '기타대출', 676078),
 ('201310', '주택담보대출', Decimal('411415.9')),
 ('201310', None, Decimal('1087493.9')),
 ('201311', '기타대출', Decimal('681121.3')),
 ('201311', '주택담보대출', Decimal('414236.9')),
 ('201311', None, Decimal('1095358.2')),
 (None, None, Decimal('2182852.1'))]

## CUBE(expr1, expr2, ...)

- CUBE는 명시한 표현식의 개수에 따라 가능한 모든 조합별로 집계한 결과를 반환한다
- 2의 (expr 수)제곱 만큼 종류별로 집계 된다

In [68]:
%%sql

SELECT
    period
    , gubun
    , SUM(loan_jan_amt) totl_nam
FROM kor_loan_status
WHERE period LIKE '2013%'
GROUP BY CUBE(period, gubun)

-- 10월 합산, 11월 합산, 기타대출 합산, 주택담보대출 합산, 전체 합산이 표시된다

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[(None, None, Decimal('2182852.1')),
 (None, '기타대출', Decimal('1357199.3')),
 (None, '주택담보대출', Decimal('825652.8')),
 ('201310', None, Decimal('1087493.9')),
 ('201310', '기타대출', 676078),
 ('201310', '주택담보대출', Decimal('411415.9')),
 ('201311', None, Decimal('1095358.2')),
 ('201311', '기타대출', Decimal('681121.3')),
 ('201311', '주택담보대출', Decimal('414236.9'))]

## GROUPING SETS(expr1, expr2, ...)

- 특성 항목에 대한 소계를 계산한다

In [69]:
%%sql

SELECT
    period
    , gubun
    , SUM(loan_jan_amt) totl_nam
FROM kor_loan_status
WHERE period LIKE '2013%'
GROUP BY GROUPING SETS(period, gubun)

-- 기간별 합산과 구분에 따른 합산을 보여준다

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('201311', None, Decimal('1095358.2')),
 ('201310', None, Decimal('1087493.9')),
 (None, '주택담보대출', Decimal('825652.8')),
 (None, '기타대출', Decimal('1357199.3'))]

# 집합 연산자

- 먼저 한국과 일본의 수출품을 출력한다

In [33]:
%%sql

SELECT goods
FROM exp_goods_asia
WHERE country = '한국'
ORDER BY seq

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('원유제외 석유류',),
 ('자동차',),
 ('전자집적회로',),
 ('선박',),
 ('LCD',),
 ('자동차부품',),
 ('휴대전화',),
 ('환식탄화수소',),
 ('무선송신기 디스플레이 부속품',),
 ('철 또는 비합금강',)]

In [34]:
%%sql

SELECT goods
FROM exp_goods_asia
WHERE country = '일본'
ORDER BY seq

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('자동차',),
 ('자동차부품',),
 ('전자집적회로',),
 ('선박',),
 ('반도체웨이퍼',),
 ('화물차',),
 ('원유제외 석유류',),
 ('건설기계',),
 ('다이오드, 트랜지스터',),
 ('기계류',)]

## UNION

- 합집합을 의미한다

In [35]:
%%sql

SELECT goods
FROM exp_goods_asia
WHERE country = '한국'
UNION -- 합집합 개념 적용
SELECT goods
FROM exp_goods_asia
WHERE country = '일본'

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('LCD',),
 ('건설기계',),
 ('기계류',),
 ('다이오드, 트랜지스터',),
 ('무선송신기 디스플레이 부속품',),
 ('반도체웨이퍼',),
 ('선박',),
 ('원유제외 석유류',),
 ('자동차',),
 ('자동차부품',),
 ('전자집적회로',),
 ('철 또는 비합금강',),
 ('화물차',),
 ('환식탄화수소',),
 ('휴대전화',)]

## UNION ALL

- UNION과 비슷하지만 중복된 항목도 모두 조회한다

In [72]:
%%sql

SELECT goods
FROM exp_goods_asia
WHERE country = '한국'
UNION ALL -- 합집합 개념 적용
SELECT goods
FROM exp_goods_asia
WHERE country = '일본'

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('원유제외 석유류',),
 ('자동차',),
 ('전자집적회로',),
 ('선박',),
 ('LCD',),
 ('자동차부품',),
 ('휴대전화',),
 ('환식탄화수소',),
 ('무선송신기 디스플레이 부속품',),
 ('철 또는 비합금강',),
 ('자동차',),
 ('자동차부품',),
 ('전자집적회로',),
 ('선박',),
 ('반도체웨이퍼',),
 ('화물차',),
 ('원유제외 석유류',),
 ('건설기계',),
 ('다이오드, 트랜지스터',),
 ('기계류',)]

## INTERSECT

- 교집합을 의미한다

In [70]:
%%sql

SELECT goods
FROM exp_goods_asia
WHERE country = '한국'
INTERSECT -- 교집합 개념 적용
SELECT goods
FROM exp_goods_asia
WHERE country = '일본'

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('선박',), ('원유제외 석유류',), ('자동차',), ('자동차부품',), ('전자집적회로',)]

## MINUS

- 차집합을 의미한다

In [71]:
%%sql

SELECT goods
FROM exp_goods_asia
WHERE country = '한국'
MINUS -- 차집합 개념 적용
SELECT goods
FROM exp_goods_asia
WHERE country = '일본'

 * oracle://ora_user:***@127.0.0.1:1521/myoracle
0 rows affected.

[('LCD',), ('무선송신기 디스플레이 부속품',), ('철 또는 비합금강',), ('환식탄화수소',), ('휴대전화',)]

## 집합 연산자의 제한사항

1. 집합 연산자로 연결되는 각 SELECT문의 SELECT 리스트의 개수와 데이터 타입은 일치해야 한다
2. 집합 연산자로 SELECT 문을 연결할 때 ORDER BY절은 맨 마지막 문장에서만 사용할 수 있다
3. BLOB, CLOB, BFILE 타입의 컬럼에 대해서는 집합 연산자를 사용할 수 없다
4. UNION, INTERSECT, MINUS 연산자는 LONG형 컬럼에는 사용할 수 없다